tbMauChu = {
	[1] = {"LuyÖn C«ng (Tr¾ng)",0},
	[2] = {"ChÝnh Ph¸i (Vµng)",1},
	[3] = {"Tµ Ph¸i (TÝm)",2},
	[4] = {"Trung LËp (Xanh)",3},
	[5] = {"S¸t Thñ (§á)",4},
	[6] = {"GM (Hång)",5},
};
tbBaseAttribute = {
	base_str = {35,20,25,30,20},
	base_dex = {25,35,25,20,15},
	base_vit = {25,20,25,30,25},
	base_eng = {15,25,25,20,40},
}

tbDoXanh ={
	[1]={
		szName = "D©y ChuyÒn",
		tbEquip =
		{
			{"Toµn th¹ch h¹ng liªn",0,4,0},
			{"Lôc PhØ Thóy Hé Th©n phï ",0,4,1},
		}
	},
	[2]={
		szName = "¸o Gi¸p",
		tbEquip =
			{
			{"ThÊt B¶o Cµ Sa",0,2,0},
			{"Ch©n Vò Th¸nh Y",0,2,1},
			{"Thiªn NhÉn MËt Trang",0,2,2},
			{"Gi¸ng Sa Bµo",0,2,3},
			{"§­êng Nghª gi¸p",0,2,4},
			{"V¹n L­u Quy T«ng Y",0,2,5},
			{"TuyÒn Long bµo",0,2,6},
			{"Long Tiªu ®¹o Y",0,2,8},
			{"Cöu VÜ B¹ch Hå trang",0,2,9},
			{"TrÇm H­¬ng sam",0,2,10},
			{"TÝch LÞch Kim Phông gi¸p",0,2,11},
			{"V¹n Chóng TÒ T©m Y",0,2,12},
			{"L­u Tiªn QuÇn",0,2,13},
		}
	},
	[3]={
		szName = "§ai L­ng",
		tbEquip =
		{
			{"Thiªn Tµm Yªu §¸i",0,6,0},
			{"B¹ch Kim Yªu §¸i",0,6,1},
		}
	},
	[4]={
		szName = "Giµy",
		tbEquip ={
			{"Cöu TiÕt X­¬ng VÜ Ngoa",0,5,0},
			{"Thiªn Tµm Ngoa",0,5,1},
			{"Kim Lò hµi",0,5,2},
			{"Phi Phông Ngoa",0,5,3},
		}
	},
	[5]={
		szName = "Bao Tay",
		tbEquip =
		{
			{"Long Phông HuyÕt Ngäc Tr¹c",0,8,0},
			{"Thiªn Tµm Hé UyÓn",0,8,1},
		}
	},
	[6]={
		szName = "Nãn",
		tbEquip ={
			{"Tú L« m·o",0,7,0},
			{"Ngò l·o qu¸n",0,7,1},
			{"Tu La Ph¸t kÕt",0,7,2},
			{"Th«ng Thiªn Ph¸t Qu¸n",0,7,3},
			{"YÓm NhËt kh«i",0,7,4},
			{"TrÝch Tinh hoµn",0,7,5},
			{"¤ Tµm M·o",0,7,6},
			{"Quan ¢m Ph¸t Qu¸n",0,7,7},
			{"¢m D­¬ng V« Cùc qu¸n",0,7,8},
			{"HuyÒn Tª DiÖn Tr¸o",0,7,9},
			{"Long HuyÕt §Çu hoµn",0,7,10},
			{"Long L©n Kh«i",0,7,11},
			{"Thanh Tinh Thoa",0,7,12},
			{"Kim Phông TriÓn SÝ ",0,7,13},
		}
	},
	[7]={
		szName = "Vò KhÝ CËn ChiÕn",
		tbEquip ={
			{"HuyÒn ThiÕt KiÕm",0,0,0},
			{"§¹i Phong §ao",0,0,1},
			{"Kim C« Bæng",0,0,2},
			{"Ph¸ Thiªn KÝch",0,0,3},
			{"Ph¸ Thiªn chïy",0,0,4},
			{"Th«n NhËt Tr·m",0,0,5},
			{"Bao tay",0,0,6},
			{"§ao ThuÉn",0,0,7},
			{"ThuÉn §ao",0,0,8},
		}
	},
	[8]={
		szName = "Ngäc Béi",
		tbEquip ={
			{"Long Tiªn H­¬ng Nang",0,9,0},
			{"D­¬ng Chi B¹ch Ngäc",0,9,1},
		}
	},
	[9]={
		szName = "Vò KhÝ TÇm Xa",
		tbEquip ={
			{"B¸ V­¬ng Tiªu",0,1,0},
			{"To¸i NguyÖt §ao",0,1,1},
			{"Khæng T­íc Linh",0,1,2},
		}
	},
	[10]={
		szName = "NhÉn",
		tbEquip ={
			{"Toµn Th¹ch Giíi ChØ ",0,3,0},
		}
	},
}

tbEquipName = {
	--  {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1}, sè  ®Çu tiªn : 1 lµ ®å hoµng kim , 2 ®å tÝm , 4 §å bach kim
	[1] = 
		{
			{
				szType = "KiÕm",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"Cang KiÕm",2,0,0,0,0,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Thanh Phong KiÕm",2,0,0,0,0,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Long TuyÒn KiÕm",2,0,0,0,0,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"Tr·m M· KiÕm",2,0,0,0,0,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"¤ Kim KiÕm",2,0,0,0,0,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"XØ KhiÕp",2,0,0,0,0,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"ThÊt XÝch KiÕm",2,0,0,0,0,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Thiªn NhËn KiÕm",2,0,0,0,0,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"HuyÒn ThiÕt KiÕm",2,0,0,0,0,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "§ao",
				szName = {
					[1] = {"Yªu §ao",2,0,0,0,1,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"§¬n ®ao",2,0,0,0,1,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Quû §Çu §ao",2,0,0,0,1,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Nh¹n Linh §ao",2,0,0,0,1,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"NguyÖt Nha §ao",2,0,0,0,1,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Ph¸ Phong §ao",2,0,0,0,1,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Cæn Ch©u B¶o ®ao",2,0,0,0,1,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"YÓn NguyÖt §ao",2,0,0,0,1,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Thanh Long §ao",2,0,0,0,1,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"§¹i Phong §ao",2,0,0,0,1,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "C«n",
				szName = {
					[1] = {"Thiªu Háa C«n ",2,0,0,0,2,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"TÒ Mi C«n ",2,0,0,0,2,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Bµn Hoa C«n ",2,0,0,0,2,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Hæ VÜ C«n ",2,0,0,0,2,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"Tiªu Bæng",2,0,0,0,2,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Can Bæng",2,0,0,0,2,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Lang Nha Bæng",2,0,0,0,2,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Hçn ThiÕt Bæng",2,0,0,0,2,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Gi¸c H¶i Bæng",2,0,0,0,2,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Kim C« Bæng",2,0,0,0,2,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "Th­¬ng",
				szName = {
					[1] = {"ThiÕt Th­¬ng",2,0,0,0,3,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"Tr­êng Th­¬ng",2,0,0,0,3,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"§iÓm Cang Th­¬ng",2,0,0,0,3,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"C©u Liªm Th­¬ng",2,0,0,0,3,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"Hoµn tö Th­¬ng",2,0,0,0,3,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"B¸o vÜ th­¬ng",2,0,0,0,3,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Nh¹n Linh Th­¬ng",2,0,0,0,3,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Tó Cèt Th­¬ng",2,0,0,0,3,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Háa NhuÖ Th­¬ng",2,0,0,0,3,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Ph¸ Thiªn KÝch",2,0,0,0,3,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "Chïy",
				szName = {
					[1] = {"To¸n §Çu chïy",2,0,0,0,4,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"B¸t L¨ng chïy",2,0,0,0,4,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Ngò Tinh chïy",2,0,0,0,4,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"TÝch LÞch chïy",2,0,0,0,4,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"L­îng Ng©n chïy ",2,0,0,0,4,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Lang Nha chïy",2,0,0,0,4,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"LiÖt T©m chïy",2,0,0,0,4,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Kim Qua chïy",2,0,0,0,4,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"NghiÖt Long chïy",2,0,0,0,4,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Ph¸ Thiªn chïy",2,0,0,0,4,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "Song §ao",
				szName = {
					[1] = {"Nga Mi ThÝch",2,0,0,0,5,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"TÊn ThiÕt Song §ao",2,0,0,0,5,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"NguyÖt Nha ThÝch",2,0,0,0,5,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"H¾c B¹ch Song §ao",2,0,0,0,5,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"TuyÕt Hoa L­îng Ng©n §ao",2,0,0,0,5,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Uyªn ¦¬ng §ao",2,0,0,0,5,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Phï Dung §ao",2,0,0,0,5,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Hå §iÖp Song §ao",2,0,0,0,5,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Thu Vò §ao",2,0,0,0,5,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Th«n NhËt Tr·m",2,0,0,0,5,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "TriÒn Thñ",
				szName = {
					[1] = {"Th« Bè TriÒn Thñ ",2,0,0,0,6,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"CÈm §o¹n TriÒn Thñ ",2,0,0,0,6,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Hæ B× TriÒn Thñ ",2,0,0,0,6,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Tinh ChÕ TriÒn Thñ ",2,0,0,0,6,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"L­îng Ng©n TriÒn Thñ ",2,0,0,0,6,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"ThiÕp Kim TriÒn Thñ ",2,0,0,0,6,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"MÆc Vò TriÒn Thñ ",2,0,0,0,6,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Kim Tµm TriÒn Thñ ",2,0,0,0,6,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Long C©n TriÒn Thñ ",2,0,0,0,6,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"LiÖt Thiªn TriÒn Thñ ",2,0,0,0,6,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "§ao ThuÉn",
				szName = {
					[1] = {"Tinh ChÕ §ao ThuÉn 1",2,0,0,0,7,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"Tinh ChÕ §ao ThuÉn 2",2,0,0,0,7,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Tinh ChÕ §ao ThuÉn 3",2,0,0,0,7,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Tinh ChÕ §ao ThuÉn 4",2,0,0,0,7,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"Tinh ChÕ §ao ThuÉn 5",2,0,0,0,7,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Tinh ChÕ §ao ThuÉn 6",2,0,0,0,7,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Tinh ChÕ §ao ThuÉn 7",2,0,0,0,7,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Tinh ChÕ §ao ThuÉn 8",2,0,0,0,7,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Tinh ChÕ §ao ThuÉn 9",2,0,0,0,7,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Tinh ChÕ §ao ThuÉn 10",2,0,0,0,7,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "ThuÉn §ao",
				szName = {
					[1] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,1,0,0,-1,-1,-1,-1,-1,-1},
					[2] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,2,0,0,-1,-1,-1,-1,-1,-1},
					[3] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,3,0,0,-1,-1,-1,-1,-1,-1},
					[4] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,4,0,0,-1,-1,-1,-1,-1,-1},
					[5] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,5,0,0,-1,-1,-1,-1,-1,-1},
					[6] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,6,0,0,-1,-1,-1,-1,-1,-1},
					[7] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,7,0,0,-1,-1,-1,-1,-1,-1},
					[8] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,8,0,0,-1,-1,-1,-1,-1,-1},
					[9] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,9,0,0,-1,-1,-1,-1,-1,-1},
					[10] = {"Tinh ChÕ ThuÉn §ao ",2,0,0,0,8,10,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},		
	[2] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "Phi §ao",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "Phi Tô TiÔn",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
			{
				szType = "CÇm",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[3] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[4] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[5] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[6] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[7] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[8] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[9] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[10] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[11] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
	[12] = 
		{
			{
				szType = "Phi Tiªu",
				szName = {
					[1] = {"ThiÕt Trñy thñ",2,0,0,0,0,1,0,0,-1,-1,-1,-1,-1,-1},
				}
			},
		},
		
}
	
tbEquipType = {
		{
			[1] = {"Vò khi cËn chiªn", 0},
			[2] = {"Vò khÝ tÇm xa", 1},
			[3] = {"¸o", 2},
			[4] = {"NhÉn", 3},
			[5] = {"D©y ChuyÒn", 4},
			[6] = {"GiÇy", 5},
			[7] = {"§ai L­ng", 6},
			[8] = {"Nãn", 7},
			[9] = {"Bao Tay", 8},
			[10] = {"Ngéc béi", 9},
			[11] = {"Ngùa", 10},
			[12] = {"MÆt N¹", 11},
		},
	}

tbPhiPhong = {
 
 }
